# In Video Quiz : Week 3

In [1]:
import numpy as np
import pandas as pd

## Quiz 1 (Lecture: Merging Dataframes)

##### Here are two DataFrames, products and invoices. The product DataFrame has an identifier and a sticker price. The invoices DataFrame lists the people, product identifiers, and quantity.

In [2]:
products = pd.DataFrame([[4109, 5.0, 'Sushi Roll'],
                        [1412, 0.5, 'Egg'],
                        [8931, 1.5, 'Bagel']],
                       columns = ['Product ID', 'Price', 'Product'])

products.set_index('Product ID', drop = True, inplace = True)

invoices = pd.DataFrame([['Ali', 4190, 1],
                        ['Eric', 1412, 12],
                        ['Ande', 8931, 6],
                        ['Sam', 4109, 2]],
                       columns = ['Customer', 'Product ID', 'Quantity'])

In [3]:
products

            Price     Product
Product ID
4109          5.0  Sushi Roll
1412          0.5         Egg
8931          1.5       Bagel

In [4]:
invoices

  Customer  Product ID  Quantity
0      Ali        4190         1
1     Eric        1412        12
2     Ande        8931         6
3      Sam        4109         2

##### Q. Assuming that we want to generate totals, how do we join these two DataFrames together so that we have one which lists all of the information we need?

### Answer:

In [5]:
answer = pd.merge(products, invoices, how='inner', left_index=True, right_on='Product ID')

answer

   Price     Product Customer  Product ID  Quantity
3    5.0  Sushi Roll      Sam        4109         2
1    0.5         Egg     Eric        1412        12
2    1.5       Bagel     Ande        8931         6

## Quiz 2 (Lecture: Pandas Idioms)

##### Suppose we are working on a DataFrame that holds information on our equipment for an upcoming backpacking trip.

In [6]:
df = pd.DataFrame([['Pack', 'Pack', 1, 33.0],
                   ['Tent', 'Shelter', 1, 80.0],
                   ['Sleeping Pad', 'Sleep', 0, 27.0],
                   ['Sleeping Bag', 'Sleep', 1, 20.0],
                   ['Toothbrush/Toothpaste', 'Health', 1, 2.0],
                   ['Sunscreen', 'Health', 1, 5.0],
                   ['Medical Kit', 'Health', 1, 3.7],
                   ['Spoon', 'Kitchen', 0, 0.7],
                   ['Stove', 'Kitchen', 1, 20.0],
                   ['Water Filter', 'Kitchen', 1, 1.8],
                   ['Water Bottle', 'Kitchen', 2, 35.0],
                   ['Pack Liner', 'Utility', 1, 1.0],
                   ['Stuff Sack', 'Utility', 0, 1.0],
                   ['Trekking Poles', 'Utility', 1, 16.0],
                   ['Rain Poncho', 'Clothing', 0, 6.0],
                   ['Shoes', 'Clothing', 1, 12.0],
                   ['Hat', 'Clothing', 1, 2.5]],
                 columns = ['Item', 'Category', 'Quantity', 'Weight'])

df.set_index('Item', drop = True, inplace = True)

df.head()

                      Category  Quantity  Weight
Item
Pack                      Pack         1    33.0
Tent                   Shelter         1    80.0
Sleeping Pad             Sleep         0    27.0
Sleeping Bag             Sleep         1    20.0
Toothbrush/Toothpaste   Health         1     2.0

##### Q. Can you use method chaining to modify the DataFrame df in one statement to drop any entries where 'Quantity' is 0 and rename the column 'Weight' to 'Weight (oz.)'?

### Answer:

In [7]:
answer = df.drop(df[df['Quantity'] == 0].index).rename(columns={'Weight': 'Weight (oz.)'})

answer

                       Category  Quantity  Weight (oz.)
Item
Pack                       Pack         1          33.0
Tent                    Shelter         1          80.0
Sleeping Bag              Sleep         1          20.0
Toothbrush/Toothpaste    Health         1           2.0
Sunscreen                Health         1           5.0
Medical Kit              Health         1           3.7
Stove                   Kitchen         1          20.0
Water Filter            Kitchen         1           1.8
Water Bottle            Kitchen         2          35.0
Pack Liner              Utility         1           1.0
Trekking Poles          Utility         1          16.0
Shoes                  Clothing         1          12.0
Hat                    Clothing         1           2.5

## Quiz 3 (Lecture: Group by)

##### Q. Looking at our backpacking equipment DataFrame, suppose we are interested in finding our total weight for each category. Use groupby to group the dataframe, and apply a function to calculate the total weight (Weight x Quantity) by category.

### Answer 1:

In [8]:
answer = df.groupby('Category').apply(lambda df,a,b: sum(df[a] * df[b]), 'Weight', 'Quantity')

answer

Category
Clothing    14.5
Health      10.7
Kitchen     91.8
Pack        33.0
Shelter     80.0
Sleep       20.0
Utility     17.0
dtype: float64

### Answer 2:

In [9]:
def totalWeight(df, w, q):
       return sum(df[w] * df[q])
       
answer = df.groupby('Category').apply(totalWeight, 'Weight', 'Quantity')

answer

Category
Clothing    14.5
Health      10.7
Kitchen     91.8
Pack        33.0
Shelter     80.0
Sleep       20.0
Utility     17.0
dtype: float64

## Quiz 4  (Lecture: Scales)

##### Suppose we have the following series.

In [10]:
s = pd.Series(['Low', 'Low', 'High', 'Medium', 'Low', 'High', 'Low'])

print(s)

0       Low
1       Low
2      High
3    Medium
4       Low
5      High
6       Low
dtype: object

##### Q. Try casting this series to categorical with the ordering Low < Medium < High.

### Answer:

In [ ]:
s.astype('category', categories=['Low', 'Medium', 'High'], ordered=True)

## Quiz 5  (Lecture: Scales)

##### Suppose we have a series that holds height data for jacket wearers.

In [12]:
s = pd.Series([168, 180, 174, 190, 170, 185, 179, 181, 175, 169, 182, 177, 180, 171])

print(s)

0     168
1     180
2     174
3     190
4     170
5     185
6     179
7     181
8     175
9     169
10    182
11    177
12    180
13    171
dtype: int64

##### Q. Use pd.cut to bin this data into 3 bins.

### Answer:

In [13]:
s.astype('category')

pd.cut(s, 3)

0     (167.978, 175.333]
1     (175.333, 182.667]
2     (167.978, 175.333]
3       (182.667, 190.0]
4     (167.978, 175.333]
5       (182.667, 190.0]
6     (175.333, 182.667]
7     (175.333, 182.667]
8     (167.978, 175.333]
9     (167.978, 175.333]
10    (175.333, 182.667]
11    (175.333, 182.667]
12    (175.333, 182.667]
13    (167.978, 175.333]
dtype: category
Categories (3, interval[float64]): [(167.978, 175.333] < (175.333, 182.667] < (182.667, 190.0]]

In [14]:
# You can also add labels for the sizes [Small < Medium < Large]

pd.cut(s, 3, labels = ['Small', 'Medium', 'Large'])

0      Small
1     Medium
2      Small
3      Large
4      Small
5      Large
6     Medium
7     Medium
8      Small
9      Small
10    Medium
11    Medium
12    Medium
13     Small
dtype: category
Categories (3, object): [Small < Medium < Large]

## Quiz 6  (Lecture: Pivot Tables)

##### Suppose we have a DataFrame with price and ratings for different bikes, broken down by manufacturer and type of bicycle.

In [15]:
Bikes = pd.DataFrame([['Mountain', 'A', 400, 8],
                     ['Mountain', 'A', 600, 9],
                     ['Road', 'A', 400, 4],
                     ['Road', 'A', 450, 4],
                     ['Mountain', 'B', 300, 6],
                     ['Mountain', 'B', 250, 5],
                     ['Road', 'B', 400, 4],
                     ['Road', 'B', 500, 6],
                     ['Mountain', 'C', 400, 5],
                     ['Mountain', 'C', 500, 6],
                     ['Road', 'C', 800, 9],
                     ['Road', 'C', 950, 10]],
                    columns = ['Bike Type', 'Manufacturer', 'Price', 'Rating'])

print(Bikes)

   Bike Type Manufacturer  Price  Rating
0   Mountain            A    400       8
1   Mountain            A    600       9
2       Road            A    400       4
3       Road            A    450       4
4   Mountain            B    300       6
5   Mountain            B    250       5
6       Road            B    400       4
7       Road            B    500       6
8   Mountain            C    400       5
9   Mountain            C    500       6
10      Road            C    800       9
11      Road            C    950      10

##### Q. Create a pivot table that shows the mean price and mean rating for every 'Manufacturer' / 'Bike Type' combination.

### Answer:

In [16]:
pd.pivot_table(Bikes, index = ['Manufacturer', 'Bike Type'])

                        Price  Rating
Manufacturer Bike Type
A            Mountain     500     8.5
             Road         425     4.0
B            Mountain     275     5.5
             Road         450     5.0
C            Mountain     450     5.5
             Road         875     9.5